Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: If you're on a system that requires superuser/root access to install modules into the directories you see when you type C<perl -e "print qq(@INC)">, you'll want to install them into a local directory (such as your home directory) and use this approach.
es: Si usa un sistema en el que la instalación de módulos en los directorios que ve al ejecutar C<perl -e "print qq(@INC)"> requiere privilegios de acceso de superusuario/raíz, posiblemente prefiera instalar los módulos en un directorio local (como su directorio personal) y usar este enfoque.

source: If you're unsure about the demand your module will have, consider sending out feelers on the C<comp.lang.perl.modules> newsgroup, or as a last resort, ask the modules list at C<modules@perl.org>.
es: Si no está seguro de la demanda que puede tener su módulo, puede sondear opiniones en el grupo de noticias C<comp.lang.perl.modules> o, como último recurso, preguntar en la lista sobre módulos, escribiendo a la dirección C<modules@perl.org>.

source: If you're uploading to CPAN, the automated gremlins will extract the README file and place that in your CPAN directory.
es: Si va a subir el módulo a CPAN, los enanitos automatizados extraerán el archivo README y lo colocarán en su directorio de CPAN.

source: If you're using VMStar:
es: Si usa VMStar:

source: If you're using untarzipme or StuffIt, the archive should be extracted now.
es: Si usa untarzipme o StuffIt, ya se habrá extraído el contenido.

source: If you're writing your own documentation in POD, the F<podchecker> utility will look for errors in your markup.
es: Al redactar documentación POD puede usar la utilidad F<podchecker> para detectar errores de marcas POD.

source: If you've found a bug with the perl interpreter or one of the modules in the standard library (those that come with Perl), you can use the L<perlbug> utility that comes with Perl (>= 5.004).
es: Si ha encontrado un error en el intérprete de perl o en uno de los módulos de la biblioteca estándar (los que se incluyen con Perl), puede usar la utilidad L<perlbug> incluida en Perl (>= 5.004) para enviar un informe.

source: If your C<DESTROY> method issues a warning during global destruction, the Perl interpreter will append the string " during global destruction" the warning.
es: Si el método C<DESTROY> genera una advertencia durante la fase de destrucción global, el intérprete de Perl agregará la cadena "I<during global destruction>" (durante la destrucción global) a la advertencia.

source: If your C<DESTROY> method throws an error, this error will be ignored.
es: Si su método C<DESTROY> genera un error, se omitirá.

source: If your Perl book isn't listed and you think it should be, let us know.
es: Si su libro sobre Perl no está en la lista y cree que deberíamos incluirlo, póngase en contacto con nosotros.

source: If your Perl success stories and testimonials may be of help to others who wish to advocate the use of Perl in their applications, or if you wish to simply express your gratitude to Larry and the Perl developers, please write to perl-thanks@perl.org .
es: Si considera que sus éxitos con Perl y sus testimonios pueden ayudar a otros programadores que desean utilizar Perl en sus proyectos, o si simplemente quiere expresar su gratitud a Larry y a los demás programadores de Perl, escriba un mensaje a la dirección perl-thanks@perl.org .

source: If your class does have an C<AUTOLOAD> method, we strongly recommend that you override C<can> in your class as well.
es: Si su clase dispone de un método C<AUTOLOAD>, le recomendamos que sobrescriba el método C<can> en su clase también.

source: If your class responds to method calls via C<AUTOLOAD>, you may want to overload C<can> to return a subroutine reference for methods which your C<AUTOLOAD> method handles.
es: Si la clase responde a llamadas a métodos a través de C<AUTOLOAD>, puede que desee sobrescribir el método C<can> para que devuelva una referencia a subrutina para aquellos métodos controlados por su método C<AUTOLOAD>.

source: If your input is binary, and is supposed to remain binary, you shouldn't decode it to a text string, of course.
es: Por supuesto, si la entrada es binaria y debe permanecer así, no debe descodificarla en una cadena de texto.

source: If your output is unbuffered, the system processes it one byte at a time without the use of a holding area.
es: Si no se usa búfer para la salida, el sistema la procesa de byte en byte sin usar espacio de almacenamiento.

source: If your sources are UTF-8 encoded, you can indicate that with the C<use utf8> pragma.
es: Si el código fuente está codificado como UTF-8, puede indicarlo con el pragma C<use utf8>:

source: If your stdio requires a seek or eof between reads and writes on a particular stream, so does Perl.
es: Si stdio requiere ejecutar seek o eof entre lecturas y escrituras para una secuencia determinada, Perl también lo requerirá

source: If yours doesn't, or if for another reason you have a statically-linked perl, B<and> the module requires compilation, you'll need to build a new Perl binary that includes the module.
es: Si no fuera el caso del suyo, o si por otra razón tiene un perl vinculado estáticamente B<y> el módulo requiere compilación, tendrá que compilar un nuevo binario de Perl que incluya el módulo.

source: If, on the other hand, you say
es: Por otra parte, si escribe

source: Ignore case.
es: No se distinguen mayúsculas de minúsculas.

source: Imagine you'd like to find a sequence of non-digits not followed by "123".
es: Suponga que desea encontrar una secuencia de caracteres que no son dígitos y que no esté seguida de "123".

source: Imagine you'd like to match everything between "foo" and "bar".
es: Suponga que desea buscar todo lo que hay entre "mesa" y "come".

source: In Perl, C<print STDOUT "$foo\n";> can be understood as "verb indirect-object object" where L</STDOUT> is the recipient of the L<print|perlfunc/print> action, and C<"$foo"> is the object being printed.
es: En Perl, C<print STDOUT "$foo\n";> se puede leer como "verbo objeto-indirecto objeto", donde L</STDOUT> es el destinatario de la acción L<print|perlfunc/print> y C<"$foo"> es el objeto que se imprime.

source: In Perl, variable interpolation happens in double-quoted strings and patterns, and list interpolation occurs when constructing the list of values to pass to a list operator or other such construct that takes a L</LIST>.
es: En Perl, la interpolación de variables se realiza en cadenas o patrones escritos entre comillas dobles, y la interpolación de listas se realiza al crear la lista de valores que se van a pasar a un operador de lista o a otra construcción similar que consuma una L</LISTA>.

source: In computers, where things are supposed to vary rapidly, "static" has a derogatory connotation, indicating a slightly dysfunctional L</variable>, L</subroutine>, or L</method>.
es: En un contexto informático, en el que se supone que las cosas cambian rápidamente, el adjetivo "estático" tiene una connotación peyorativa, que indica que la L</variable>, L</subrutina> o L</método> es ligeramente disfuncional.

source: In fact, C<(?!)> gets optimised into C<(*FAIL)> internally.
es: De hecho, internamente C<(?!)> se optimiza a C<(*FAIL)>.

source: In general, code that can be easily converted to run on another L</platform>, where "easily" can be defined however you like, and usually is.
es: En general, se designa así al código que se puede adaptar fácilmente a otra L</plataforma>; puede definir "fácilmente" como le parezca (y generalmente se hace así).

source: In particular, if you use C<eval {}> you should localize C<$@>, and if you use C<system> or backticks, you should localize C<$?>.
es: En particular, si usa C<eval {}> debería localizar C<$@>, y si usa C<system> o comillas invertidas, debería localizar C<$?>.

source: In particular, though the first such conversion may be time-consuming, repeated operations will not need to redo the conversion.
es: Así, aunque la primera conversión tarde un poco más, al repetir una operación no será necesario repetir la conversión.

source: In scalar context it reads a single line from the filehandle, and in list context it reads the whole file in, assigning each line to an element of the list:
es: En contexto de escalar, este operador lee una sola línea del identificador de archivo, mientras que en contexto de lista lee todo el archivo y asigna cada línea a un elemento de la lista:

source: In some cases, Perl will warn you that you're doing something wrong, with a friendly warning:
es: En algunos casos Perl le mostrará un mensaje amistoso para avisarle de que está haciendo algo mal:

source: In C, the L</command> name is passed to the program as the first command-line argument.
es: En C, el nombre de un L</comando> se pasa al programa como el primer argumento de línea de comandos.

source: In C<< native floating point --> native integer >> conversions the magnitude of the result is less than or equal to the magnitude of the source.
es: En las conversiones C<< punto flotante nativo --> entero nativo >>, la magnitud del resultado es menor o igual que la magnitud del número de origen.

source: In C<CLONE> you can do whatever you need to do, like for example handle the cloning of non-Perl data, if necessary.
es: C<CLONE> le permite hacer todo lo que necesite, como controlar la clonación de datos que no sean de Perl, si es necesario.

source: In English grammar, a short noun phrase between a verb and its direct object indicating the beneficiary or recipient of the action.
es: En gramática inglesa, una frase nominal corta, situada entre un verbo y su objeto directo, que indica el beneficiario o destinatario de la acción.

source: In English, that second interpretation reads as "call a subroutine named Class(), then call new() as a method on the return value of Class()".
es: La segunda interpretación significa "llamar a una subrutina denominada Clase() y después llamar a new() como un método en el valor devuelto por Clase()".

source: In I<Perl Best Practices> (copyright 2004, Published by O'Reilly Media, Inc.), Damian Conway provides a list of criteria to use when deciding if OO is the right fit for your problem:
es: En el libro I<Perl Best Practices> (publicado en 2004 por O'Reilly Media, Inc.), Damian Conway proporciona una lista de criterios para decidir si la orientación a objetos se ajusta a nuestro problema:

source: In L</shell> programming, the syntactic combination of a program name and its arguments.
es: En programación de L</shell>, la combinación sintáctica de un nombre de programa y sus argumentos.

source: In Perl culture, a portmanteau of "sharp" and "bang", meaning the C<#!> sequence that tells the system where to find the interpreter.
es: En la cultura Perl es la combinación de las palabras "sharp" y "bang", y se refiere a la secuencia C<#!> que indica al sistema dónde puede encontrar el intérprete.

source: In Perl culture, it more often refers to an alphanumeric L</identifier> (including underscores), or to a string of nonwhitespace L<characters|/character> bounded by whitespace or string boundaries.
es: En la cultura Perl normalmente hace referencia a un L</identificador> alfanumérico (guiones bajos incluidos) o a una cadena de L<caracteres|/carácter> sin espacios en blanco limitada por espacio en blanco o delimitadores de cadena.

source: In Perl culture, the word is politely avoided.
es: En la cultura Perl es de buena educación evitar el uso de esta palabra.

source: In Perl most objects are hashes, but the OO systems we recommend keep you from having to worry about this.
es: En Perl la mayoría de los objetos son hashes, pero los sistemas de orientación a objetos recomendados evitan tener que preocuparse de estos detalles.

source: In Perl the groups are numbered sequentially regardless of being named or not.
es: En Perl los grupos se numeran secuencialmente, independientemente de si tienen nombre o no.

source: In Perl you can backtrack into a recursed group, in PCRE and Python the recursed into group is treated as atomic.
es: En Perl se puede dar marcha atrás en un grupo recursivo, mientras que en PCRE y en Python el grupo al que se llega de forma recursiva se trata como si fuera atómico.

source: In Perl, storage locations (L<lvalues|/lvalue>) spontaneously generate themselves as needed, including the creation of any L</hard reference> values to point to the next level of storage.
es: En Perl, las ubicaciones de almacenamiento (L<valores-izquierda|/valor-izquierda>) se generan espontáneamente cuando es necesario. Esto incluye la creación de cualquier valor de L</referencia estricta> que apunte al siguiente nivel de almacenamiento.

source: In Perl, a comment is introduced by a C<#> character and continues to the end of the line.
es: En Perl se puede agregar un comentario mediante un carácter C<#>, y los comentarios se pueden extender hasta el final de la línea.

source: In Perl, a class's constructor is just another method, unlike some other languages, which provide syntax for constructors.
es: En Perl, el constructor de una clase es un método más; otros lenguajes de programación tienen una sintaxis especial para ellos.

source: In Perl, a return value may be either a L</list> or a L</scalar>.
es: En Perl, un valor devuelto puede ser una L</lista> o un L</escalar>.

source: In Perl, any package can be a class.
es: En Perl, cualquier paquete puede ser una clase.

source: In Perl, any value that would look like C<""> or C<"0"> if evaluated in a string context.
es: En Perl, cualquier valor equivalente a C<""> o C<"0">, si se evalúa en contexto de cadena.

source: In Perl, however, it's just a fancy form of quoting.
es: En Perl no es más que una forma sofisticada de escribir algo entre comillas.

source: In Perl, it comes in separately as C.
es: En Perl se incluye por separado, como C.

source: In Perl, methods are simply subroutines that live in a class's package.
es: En Perl, los métodos no son más que subrutinas que pertenecen al paquete de una clase.

source: In Perl, only certain special variables are truly global--most variables (and all subroutines) exist only in the current L</package>.
es: En Perl, solo algunas variables especiales son realmente globales; la mayoría de las variables (y todas las subrutinas) solo existen en el L</paquete> actual.

source: In Perl, there is no special keyword for constructing an object.
es: En Perl no hay una palabra reservada especial para construir un objeto.

source: In Perl, you just can't use them to name L<labels|/label> or L<filehandles|/filehandle>.
es: En Perl no puede usar palabras reservadas para designar L<etiquetas|/etiqueta> o L<identificadores de archivo|/identificador de archivo>.

source: In Unix, a sequence of zero or more non-newline characters terminated with a L</newline> character.
es: En Unix, una serie de cero o más caracteres que no son de nueva línea, culminados con un L</carácter de nueva línea>.

source: In Unix, often commensurate with a L</line>, or a blank-line-terminated set of lines (a "paragraph").
es: En Unix, suele corresponder a una L</línea>, o un conjunto de líneas que termina en una línea en blanco (un "párrafo").

source: In a sense, only the package is global, since the symbols in the package's symbol table are only accessible from code compiled outside the package by naming the package.
es: En cierto modo, solo el paquete es global, ya que fuera del paquete solo se puede acceder a los símbolos de la tabla de símbolos del paquete haciendo referencia al paquete.

source: In a L</class> method, the invocant is a package name.
es: En un método de L</clase>, el invocante es un nombre de paquete.

source: In a Unicode encoding, multiple subsequent bytes can be used to store a single code point, or simply: character.
es: En una codificación de Unicode se pueden utilizar varios bytes seguidos para almacenar un solo código de carácter (o carácter).

source: In a context not requiring a list value, the value of what appears to be a list literal is simply the value of the final element, as with the C comma operator.
es: En un contexto que no requiera una lista, el valor de lo que parece ser un literal de lista es simplemente el valor del último elemento, igual que con el operador coma en C.

source: In a reciprocal fashion, an operation provides either a scalar or a list context to each of its arguments.
es: De forma recíproca, cualquier operación establece un contexto de escalar o un contexto de lista para cada uno de sus argumentos.

source: In addition to being tracked by RT, mail to perlbug will automatically be forwarded to perl5-porters (with manual moderation, so please be patient).
es: Además de iniciar el seguimiento mediante RT, un mensaje enviado a perlbug se reenviará automáticamente a perl5-porters (la lista tiene moderador, por lo que debe ser paciente).

source: In addition to interacting with the C<(*SKIP)> pattern, C<(*MARK:NAME)> can be used to "label" a pattern branch, so that after matching, the program can determine which branches of the pattern were involved in the match.
es: Además de para interactuar con el patrón C<(*SKIP)>, se puede usar C<(*MARK:NOMBRE)> para "marcar" una rama del patrón, de forma que después de la búsqueda de coincidencias el programa pueda determinar qué ramas del patrón participaron en la coincidencia.

source: In addition to the Keepers of the Pumpkin also Alan Champion, Mark Dominus, Andreas KE<0xf6>nig, John Macdonald, Matthias Neeracher, Jeff Okamoto, Michael Peppler, Randal Schwartz, and Paul D. Smith sent corrections and additions.
es: Además de los titulares de la calabaza, también enviaron correcciones y adiciones Alan Champion, Mark Dominus, Andreas KE<0xf6>nig, John Macdonald, Matthias Neeracher, Jeff Okamoto, Michael Peppler, Randal Schwartz y Paul D. Smith.

source: In addition to this limitation, the exponent of the binary number is also restricted when it is represented as a floating point number.
es: Además de esta limitación, el exponente del número binario también está restringido cuando se representa como un número de punto flotante.

source: In addition, when unqualified, the identifiers STDIN, STDOUT, STDERR, ARGV, ARGVOUT, ENV, INC, and SIG are forced to be in package C<main>, even when used for other purposes than their built-in ones.
es: Además, cuando no se usan los nombres calificados, los identificadores STDIN, STDOUT, STDERR, ARGV, ARGVOUT, ENV, INC y SIG se almacenan en el paquete C<main>, incluso cuando se usan para propósitos distintos de los predefinidos.

source: In addition, Perl defines the following: X<\g> X<\k> X<\K> X<backreference>
es: Además, Perl define lo siguiente: X<\g> X<\k> X<\K> X<backreference> X<retrorreferencia>

source: In addition, many modules on CPAN already use C<Moose>, providing you with lots of examples to learn from.
es: Además, muchos módulos de CPAN ya usan C<Moose>, lo que proporciona muchos ejemplos de los que puede aprender.

source: In addition, plenty of code in the wild does all of its OO "by hand", using just the Perl built-in OO features.
es: Además, existe mucho código en el que se usa orientación a objetos "a mano", basado en las características de orientación a objetos predefinidas de Perl.

source: In addition, several special variables that provide windows into the inner working of Perl have names containing punctuation characters and control characters.
es: Por otra parte, varias variables especiales que proporcionan acceso al medio interno de Perl tienen nombres que contienen caracteres de puntuación y caracteres de control.

source: In addition, some of the modules shipped with Perl include C or XS code.
es: Además, algunos de los módulos distribuidos con Perl incluyen código C o XS.

source: In addition, subroutines are named with an initial '&', though this is optional when unambiguous, just as the word "do" is often redundant in English.
es: Por otra parte, se usa el carácter "&" para designar subrutinas, aunque esto es opcional cuando no haya ambigüedad, igual que el sujeto de una frase en español es a menudo redundante cuando va implícito en el verbo, como en "(yo) tengo lo que usted necesita".

source: In an L</instance> method, the invocant is an object reference.
es: En un método de L</instancia>, el invocante es una referencia a objeto.

source: In ancient days, referred to a collection of subroutines in a I<.pl> file.
es: Antiguamente se llamaba así a un conjunto de subrutinas de un archivo I<.pl>.

source: In ancient times, Unix was also used to refer to some code that a couple of people at Bell Labs wrote to make use of a PDP-7 computer that wasn't doing much of anything else at the time.
es: Antiguamente también se llamaba Unix al código que un par de empleados de Bell Labs escribió para usar un equipo PDP-7 que en ese momento estaba más bien ocioso.

source: In any way, if you're seeing failures beyond those mentioned in this document, please consider upgrading to the latest Hurd before reporting the failure as a bug.
es: En cualquier caso, si ve más errores que los mencionados en este documento, debería actualizar a la versión más reciente de Hurd antes de notificar los errores.

source: In case you're not familiar with the "regular" Version 8 regex routines, here are the pattern-matching rules not described above.
es: En caso de que no esté familiarizado con la versión 8 "normal" de las rutinas de expresiones regulares, se indican aquí las reglas de coincidencia de patrones no descritas anteriormente.

source: In computer languages (including Perl), the notion that a given class may have multiple direct ancestors or L<base classes|/base class>.
es: En lenguajes informáticos (incluido Perl), la noción de que una clase determinada puede tener varios antepasados directos, o L<clases base|/clase base>.

source: In computer languages, the notion that L<classes|/class> reproduce asexually so that a given class can only have one direct ancestor or L</base class>.
es: En lenguajes informáticos, la noción de que las L<clases|/clase> se reproducen asexualmente, de forma que una clase determinada solo puede tener un antecesor directo (una L</clase base>).

source: In computers, refers to a L</subroutine> or L</operator> that returns a L</value>.
es: En programación, es una L</subrutina> o un L</operador> que devuelve un L</valor>.

source: In contrast, C<a*ab> will match the same as C<a+b>, since the match of the subgroup C<a*> is influenced by the following group C<ab> (see L<"Backtracking">).
es: En cambio, C<a*ab> coincidirá igual que C<a+b>, ya que la coincidencia del subgrupo C<a*> está influenciada por el texto del grupo C<ab> siguiente (vea L<"Vuelta atrás">).

source: In corporate life, to grant official approval to a thing, as in, "The VP of Engineering has blessed our WebCruncher project." Similarly in Perl, to grant official approval to a L</referent> so that it can function as an L</object>, such as a WebCruncher object.
es: En el mundo empresarial, conceder oficialmente la aprobación a algo. Por ejemplo, "El vicepresidente del departamento de ingeniería ha bendecido el proyecto WebCruncher." De forma similar, en Perl significa conceder la aprobación oficial a un L</referente> para que pueda funcionar como un L</objeto> (por ejemplo, un objeto WebCruncher).

source: In decimal representation this is close to 16 decimal digits and decimal exponents in the range of -304..304.
es: En representación decimal, estos límites se acercan a 16 dígitos decimales y exponentes decimales en el intervalo -304..304.

source: In fact if you want to update your local repository without touching your working directory you do:
es: De hecho, si desea actualizar el repositorio local sin tocar su directorio de trabajo, ejecute:
